cases/chpt4-ice-pT-hot/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    hot
    {
        type            wall;
        inGroups        1(wall);
        nFaces          76;
        startFace       11400;
    }
    cold
    {
        type            wall;
        inGroups        1(wall);
        nFaces          76;
        startFace       11476;
    }
    top
    {
        type            patch;
        nFaces          76;
        startFace       11552;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          76;
        startFace       11628;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11552;
        startFace       11704;
    }
)

// ************************************************************************* //
